iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/ft5336/ft5336_reg.h
/*******************************************************************************
* Register      : P3_YL
* Address       : 0X12
* Bit Group Name: Third Touch Y Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P3_YL_TP_BIT_MASK        0xFFU
#define   FT5336_P3_YL_TP_BIT_POSITION    0
int32_t ft5336_p3_yl_tp(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_WEIGHT
* Address       : 0X13
* Bit Group Name: Third Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P3_WEIGHT_BIT_MASK        0xFFU
#define   FT5336_P3_WEIGHT_BIT_POSITION    0
int32_t ft5336_p3_weight(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P3_MISC
* Address       : 0X14
* Bit Group Name: Third Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P3_MISC_BIT_MASK        0xF0U
#define   FT5336_P3_MISC_BIT_POSITION    4
int32_t ft5336_p3_misc(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_XH
* Address       : 0X15
* Bit Group Name: Fourth Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   FT5336_P4_XH_EF_BIT_MASK        0xC0U
#define   FT5336_P4_XH_EF_BIT_POSITION    6
int32_t ft5336_p4_xh_ef(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_XH
* Address       : 0X15
* Bit Group Name: Fourth Touch X High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   FT5336_P4_XH_TP_BIT_MASK        0x0FU
#define   FT5336_P4_XH_TP_BIT_POSITION    0
int32_t ft5336_p4_xh_tp(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_XL
* Address       : 0X16
* Bit Group Name: Fourth Touch X Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P4_XL_TP_BIT_MASK        0xFFU
#define   FT5336_P4_XL_TP_BIT_POSITION    0
int32_t ft5336_p4_xl_tp(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_YH
* Address       : 0X17
* Bit Group Name: Fourth Touch ID
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   FT5336_P4_YH_TID_BIT_MASK        0xF0U
#define   FT5336_P4_YH_TID_BIT_POSITION    4
int32_t ft5336_p4_yh_tid(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_YH
* Address       : 0x17
* Bit Group Name: Fourth Touch Y High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   FT5336_P4_YH_TP_BIT_MASK        0x0FU
#define   FT5336_P4_YH_TP_BIT_POSITION    0
int32_t ft5336_p4_yh_tp(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_YL
* Address       : 0X18
* Bit Group Name: Fourth Touch Y Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P4_YL_TP_BIT_MASK        0xFFU
#define   FT5336_P4_YL_TP_BIT_POSITION    0
int32_t ft5336_p4_yl_tp(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_WEIGHT
* Address       : 0X19
* Bit Group Name: Fourth Touch Weight(pressure)
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P4_WEIGHT_BIT_MASK        0xFFU
#define   FT5336_P4_WEIGHT_BIT_POSITION    0
int32_t ft5336_p4_weight(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P4_MISC
* Address       : 0X1A
* Bit Group Name: Fourth Touch Area
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P4_MISC_BIT_MASK        0xF0U
#define   FT5336_P4_MISC_BIT_POSITION    4
int32_t ft5336_p4_misc(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_XH
* Address       : 0X1B
* Bit Group Name: Fifth Event Flag
* Permission    : R
* Default value : 0xF0U
*******************************************************************************/
#define   FT5336_P5_XH_EF_BIT_MASK        0xC0U
#define   FT5336_P5_XH_EF_BIT_POSITION    6
int32_t ft5336_p5_xh_ef(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_XH
* Address       : 0X1B
* Bit Group Name: Fifth Touch X High Position
* Permission    : R
* Default value : 0x0FU
*******************************************************************************/
#define   FT5336_P5_XH_TP_BIT_MASK        0x0FU
#define   FT5336_P5_XH_TP_BIT_POSITION    0
int32_t ft5336_p5_xh_tp(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : P5_XL
* Address       : 0X1C
* Bit Group Name: Fifth Touch X Low Position
* Permission    : R
* Default value : 0xFFU
*******************************************************************************/
#define   FT5336_P5_XL_TP_BIT_MASK        0xFFU
#define   FT5336_P5_XL_TP_BIT_POSITION    0
int32_t ft5336_p5_xl_tp(ft5336_ctx_t *ctx, uint8_t *value);

