iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/ft5336/ft5336_reg.h
/*******************************************************************************
* Register      : DISTANCE_LEFT_RIGHT
* Address       : 0X94
* Bit Group Name: 
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   FT5336_DISTANCE_LR_BIT_MASK           0xFFU
#define   FT5336_DISTANCE_LR_BIT_POSITION       0
int32_t  ft5336_disatnce_left_right(ft5336_ctx_t *ctx, uint8_t value);
        
/*******************************************************************************
* Register      : DISTANCE_UP_DOWN
* Address       : 0X95
* Bit Group Name: 
* Permission    : RW
* Default value : 0x19
*******************************************************************************/
#define   FT5336_DISTANCE_UD_BIT_MASK           0xFFU
#define   FT5336_DISTANCE_UD_BIT_POSITION       0
int32_t ft5336_distance_up_down(ft5336_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : DISTANCE_ZOOM
* Address       : 0X96
* Bit Group Name: 
* Permission    : RW
* Default value : 0x32
*******************************************************************************/
#define   FT5336_DISTANCE_ZOOM_BIT_MASK           0xFFU
#define   FT5336_DISTANCE_ZOOM_BIT_POSITION       0
int32_t ft5336_distance_zoom(ft5336_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : LIB_VER_H
* Address       : 0XA1
* Bit Group Name: 
* Permission    : R
* Default value : None
*******************************************************************************/
#define   FT5336_LIB_VER_H_BIT_MASK           0xFFU
#define   FT5336_LIB_VER_H_BIT_POSITION       0
int32_t ft5336_lib_ver_high(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : LIB_VER_L
* Address       : 0XA2
* Bit Group Name: 
* Permission    : R
* Default value : None
*******************************************************************************/
#define   FT5336_LIB_VER_L_BIT_MASK           0xFFU
#define   FT5336_LIB_VER_L_BIT_POSITION       0
int32_t ft5336_lib_ver_low(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : CIPHER
* Address       : 0XA3
* Bit Group Name: 
* Permission    : R
* Default value : 0x06
*******************************************************************************/
#define   FT5336_CIPHER_BIT_MASK           0xFFU
#define   FT5336_CIPHER_BIT_POSITION       0
int32_t ft5336_cipher(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : G_MODE
* Address       : 0XA4
* Bit Group Name: 
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   FT5336_G_MODE_BIT_MASK           0xFFU
#define   FT5336_G_MODE_BIT_POSITION       0
int32_t ft5336_g_mode(ft5336_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : PWR_MODE
* Address       : 0XA5
* Bit Group Name: 
* Permission    : RW
* Default value : 0x00
*******************************************************************************/
#define   FT5336_PWR_MODE_BIT_MASK           0xFFU
#define   FT5336_PWR_MODE_BIT_POSITION       0
int32_t ft5336_pwr_mode(ft5336_ctx_t *ctx, uint8_t value);

/*******************************************************************************
* Register      : FIRMID
* Address       : 0XA6
* Bit Group Name: 
* Permission    : R
* Default value : None
*******************************************************************************/
#define   FT5336_FIRMID_BIT_MASK           0xFFU
#define   FT5336_FIRMID_BIT_POSITION       0
int32_t ft5336_firm_id(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : FOCALTECH_ID
* Address       : 0XA8
* Bit Group Name: 
* Permission    : R
* Default value : 0x11
*******************************************************************************/
#define   FT5336_CHIP_ID_BIT_MASK           0xFFU
#define   FT5336_CHIP_ID_BIT_POSITION       0
int32_t ft5336_chip_id(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : RELEASE_CODE_ID
* Address       : 0XAF
* Bit Group Name: 
* Permission    : R
* Default value : 0x001
*******************************************************************************/
#define   FT5336_RC_ID_BIT_MASK           0xFFU
#define   FT5336_RC_ID_BIT_POSITION       0
int32_t ft5336_release_code_id(ft5336_ctx_t *ctx, uint8_t *value);

/*******************************************************************************
* Register      : STATE
* Address       : 0XBC
* Bit Group Name: 
* Permission    : RW
* Default value : 0x01
*******************************************************************************/
#define   FT5336_STATE_BIT_MASK           0xFFU
#define   FT5336_STATE_BIT_POSITION       0
int32_t ft5336_state(ft5336_ctx_t *ctx, uint8_t value);

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif
#endif /* FT5336_REG_H */


/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
